CVCapp/app/controllers/accounts_controller.rb

SELECT `accounts`.* FROM `accounts`
---
  def index
    @accounts = Account.all

INSERT INTO `accounts` (`account_num`, `created_at`, `description`, `max_contacts`, `name`, `updated_at`) VALUES ('0000234', '2014-06-07 19:25:08', 'this is a test', 500, 'new account num', '2014-06-07 19:25:08')
---
  def create
    @account = Account.new(account_params)

    respond_to do |format|
      if @account.save

UPDATE `accounts` SET `description` = 'desc. for Test account.  This is some more info...', `name` = 'Test Account #1', `updated_at` = '2014-06-10 13:53:53' WHERE `accounts`.`id` = 1
---
  def update
    respond_to do |format|
      if @account.update(account_params)

DELETE FROM `accounts` WHERE `accounts`.`id` = 8
---
  def destroy
    @account.destroy

SELECT  `accounts`.* FROM `accounts`  WHERE `accounts`.`id` = 8 LIMIT 1
---
    def set_account
      @account = Account.find(params[:id])