CVCapp/app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts`  WHERE `contacts`.`account_id` = 1 AND (name like '%wils%')  ORDER BY `contacts`.`name` ASC
SELECT `contacts`.* FROM `contacts`  WHERE `contacts`.`account_id` = 2
---
  def index
    if current_user.master_admin?
      @contacts = Contact.order(:name).where("name like ?", "%#{params[:term]}%")
    elsif current_user.admin? && (current_user.account)
      @contacts = current_user.account.contacts.order(:name).where("name like ?", "%#{params[:term]}%")
    else
      @contacts = []
    end

    respond_to do |format|
      format.html {  }
      format.json {
        # render json: @contacts.to_json
        render json: @contacts.map{ |c| {label: c.name, id: c.id} }

INSERT INTO `contacts` (`account_id`, `created_at`, `misc`, `name`, `updated_at`) VALUES (2, '2014-06-10 03:16:03', 'cous...', 'Caroline Wilson', '2014-06-10 03:16:03')
---
  def create
    @contact = Contact.new(contact_params)
    # force this contact to be in the same account as the current user is
    if session[:acct_id] > 0
      @contact.account_id = session[:acct_id]
    end

    respond_to do |format|
      if @contact.save

UPDATE `contacts` SET `misc` = 'my cous also...', `updated_at` = '2014-06-10 03:06:38' WHERE `contacts`.`id` = 5
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)

DELETE FROM `contacts` WHERE `contacts`.`id` = 6
---
  def destroy
    @contact.destroy

SELECT  `contacts`.* FROM `contacts`  WHERE `contacts`.`id` = 6 LIMIT 1
---
    def set_contact_and_checkid
      @contact = Contact.find(params[:id])