CVCapp/app/controllers/sys_messages_controller.rb

SELECT  `contacts`.* FROM `contacts`  WHERE `contacts`.`id` = 1 LIMIT 1
INSERT INTO `sys_messages` (`attempts`, `contact_id`, `created_at`, `from_account_id`, `from_user_id`, `msg`, `updated_at`) VALUES (0, '1', '2014-06-16 22:37:16', 1, 10, 'this is a test', '2014-06-16 22:37:16')
---
  def create
    # puts(sys_message_params)

    # First, check to make Sure this contact is in this Account...
    contact = Contact.find(sys_message_params[:contact_id])
    if session[:acct_id] && (session[:acct_id] != 0) && (session[:acct_id] != contact.account_id)
      redirect_to root_path
      return
    end

    @sys_message = SysMessage.new(sys_message_params)
    @sys_message.from_account_id = session[:acct_id]
    @sys_message.from_user_id =    session[:user_id]
    @sys_message.attempts = 0

    # This sends the message to the Contact's device(s)   (this is in the model...)
    puts(ENV['my_mail_server'])
    @sys_message.send_message

    respond_to do |format|
      if @sys_message.save