CVCapp/app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
	def index
		if current_user.master_admin?
		    @users = User.all

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
	def show
		@user = User.find params[:id]

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1
---
	def edit
		@user = User.find params[:id]